/*
 * @Date: 2023-08-04 09:08:13
 * @Author: Bruce Hsu
 * @Description: 
 */
export const AUTH_TOKEN = "auth_token"
export const HTTP_LINK = "//localhost:3000/graphql"
export const DEFAULT_PAGE_SIZE = 10
export const CHATGPT_URL = "http://127.0.0.1:3000/stream/chat"
export const AI_DRWA_URL = "http://127.0.0.1:3000/stream/generatedImg"
export const MODEL_SELECT = [
    { id: 1, name: "ChatGPT-3.5", available: false },
    { id: 2, name: "ChatGPT-4.0", available: true },
    { id: 3, name: "Calude2", available: true }
]
export const surpriseMePrompts = [
  '鳄梨形状的扶手椅',
  '萨尔瓦多·达利的超现实主义梦幻油画，描绘了一只下棋的猫',
  '泰迪熊在日本买杂货，浮世绘',
  '马蒂斯的一幅人形机器人下棋的油画',
  '熊猫疯狂科学家混合闪闪发光的化学物质，数字艺术',
  "夏威夷两只老鼠的 35 毫米宏观照片，它们每只都穿着小泳衣，并携带小冲浪板，数字艺术",
  '深蓝色背景的水族馆中可爱的热带鱼的 3D 渲染，数字艺术',
  '一名宇航员在太空热带度假胜地闲逛，蒸汽波',
  '深色背景中身穿中世纪皇家长袍、头戴华丽王冠的水豚的油画肖像',
  '描绘汉堡包和炸薯条的彩色玻璃窗',
  '铅笔和水彩画描绘了未来一座拥有飞行汽车的明亮城市',
  '一个阳光明媚的室内休息区，有一个清澈的水池和另一个半透明的粉红色水池，旁边有一扇大窗户，数字艺术',
  '算命的柴犬在巨大的汉堡中解读你的命运，数字艺术',
  '戴着珍珠耳环的海獭',
  '宇宙飞船里一只恼怒的猫的油画棒画',
  '星夜风格的狐狸画',
  '一碗看起来像怪物的汤，用羊毛编织而成',
  '一个毛绒玩具机器人坐在黄墙上',
  '海水反射水面上的合成波风格日落，数字艺术',
  '两座未来派的塔楼，天桥上覆盖着茂密的树叶和数字艺术',
  '彩虹色热气球在反射湖上空飞行的 3D 渲染',
  '戴着耳机的超级英雄的漫画书封面',
  '黑色背景上彩色粉末的中心爆炸',
  '一张萨摩耶犬伸出舌头拥抱一只白色暹罗猫的照片',
  '一张白色毛皮怪物站在紫色房间里的照片',
  "米开朗基罗的大卫雕塑戴着耳机打碟的照片",
  '火星上骑马的武士',
  '一辆现代、时尚的凯迪拉克沿着加德纳高速公路行驶,背景是多伦多市中心,镜头光晕,50 毫米摄影',
  '一张蓝眼睛、金发的年轻女子的真实照片',
  '一个人站在通往另一个维度的星门前',
  '海绵宝宝',
  '一只在热狗摊工作的迅猛龙',
  '夜晚,一名男子走在九龙繁华的街道上,被许多明亮的霓虹灯招牌照亮,50毫米镜头',
  '充满活力的烧烤，采用皮克斯动画电影的风格',
  '未来派机器人舞蹈俱乐部，霓虹灯',
  '久违的星球大战1990年日本动漫',
  '魔方形状的汉堡，专业美食摄影',
  '合成波刺猬、银翼杀手赛博朋克',
  '宇航员在遥远的星球上遇到外星生命形式，摄影',
  '探索开普敦的恐龙，摄影',
  '一个男人爱上他的电脑，数字艺术',
  '一张半机械人夜间探索东京的照片',
  '1920 年代，德古拉走在纽约街头，黑白摄影',
  '一只睡觉的猫',
  '一只睡觉的狗',
];
